* DONE getting guixSD to reconfigure
CLOSED: [2016-08-22 Mon 14:40]
:LOGBOOK:
- State "DONE"       from              [2016-08-22 Mon 14:40]
:END:
I get this error when I try

#+BEGIN_SRC sh :results output
guix system reconfigure /etc/config.scm
#+END_SRC

#+RESULTS:
#+begin_example
/gnu/store/bw3cdkc2cxpiiqi4afgk2vjgyqpzjrkv-system
/gnu/store/79r4f4q85l4hmk69nm0xdmfq1rg82ws3-grub.cfg
/gnu/store/gka9rl2k8mqqi27rrvjpgz6yw165d3if-grub-2.02beta3
guix system: error: symlink: File exists: "/var/guix/profiles/system-2-link"
#+end_example
** gpg

My public key is available to GuixSD and my secret key seems to be available as well.

#+BEGIN_SRC sh :results output
gpg --list-keys
#+END_SRC

#+RESULTS:
: /home/joshua/.gnupg/pubring.kbx
: -------------------------------
: pub   rsa2048 2016-05-17 [SC] [expires: 2017-05-17]
:       AAD617F76D505C188A558D0BC8FA3D82C7B1326F
: uid           [ultimate] Joshua Branson (This is my hotmail gpg key.) <bransoj@hotmail.com>
: sub   rsa2048 2016-05-17 [E] [expires: 2017-05-17]
:
\\

~gpg --list-secret-keys~
\\

So I can encrypt stuff, but NOT decrypt stuff.  I'm getting this error when I try decrypting a file with ~gpg -d filename~ \\

~gpg: public key decryption failed: No pinentry~

I need to have gpg-agent and pinentry installed, which I do.  I also have pinentry-gtk2 installed.

Also gpg-agent does not seem to know where pinentry-gtk2 is.  So it is NOT able to ask my for a passphrase to decrypt a file.

* making GuixSD automatically swap caps
This email list letter might let me do it.  Also it looks like GuixSD uses Slim
https://lists.gnu.org/archive/html/help-guix/2016-08/msg00070.html
#+BEGIN_SRC sh :results output
cat ~/.xsession
#+END_SRC

#+RESULTS:
: #!/bin/sh
:
: setxkbmap dvorak
: setxkbmap -option 'ctrl:swapcaps'


